[{"source": "https://manipaltechnologies.com/careers/", "text": "Careers The Manipal Technologies Limited invites people who believe in their ability to work on fundamental principles and create new markets for the fast-changing Indian business scenario. New opportunities and new technologies beckon us and we are on the lookout for those who can turn the opportunities into achievements. You need to have aptitude, a good attitude, the willingness to work in a team and a dedication to keeping commitments. Our business values are those that come naturally to good human beings – Honesty, Integrity, Trustworthiness and Respect for other Individuals. If you believe in these values and have the drive to use Innovation & Creativity as the cornerstone for creating successful businesses in today’s business environment, then Manipal Technologies Limited is the correct place for you. For your Career opportunities with MTL click Here", "type": "url", "added_date": "2025-05-10T22:43:35.352276"}, {"source": "https://manipaltechnologies.com/contact-us/", "text": "Corporate Office Manipal Technologies Limited CIN: U22219KA2000PLC026222 Registered office address: Udayavani Building, Press Corner, Manipal – 576104 Karnataka Contact No. +91 820 2205000, +91 820 4275000 Fax: +91 820 2570831 E-mail: [email protected] For Queries related to CSP / Merchant / BC on-boarding: +91 84482 87029 Drop Us a Line European Non European Name* E-mail Address* Contact No.* Subject* Details Send * – mandatory fields Branches Chennai Manipal Technologies Limited # GF, Vasant Apartment, No.9 Monteith Lane, Egmore, Chennai- 600008 Tel. No.: +91 – 44 – 42639870 Mumbai Manipal Technologies Limited 101/123, 1st Floor, The Summit Business Bay, Andheri East Mumbai – 400093 Bengaluru Manipal Technologies Limited The Landmark, 3rd and 6th Floor, # 25/15 MG Road Next to Trinity Metro Station, Bengaluru – 560 001 Delhi NCR Manipal Technologies Limited Unit No. 910, 9th Floor, Logix City Centre, Sector-32, Noida 201 301 Gurugram Manipal Business Solutions Private Limited (Unit of Manipal Technologies Limited)\r\n\r\n                                    ‘PARK CENTRA’\r\n\r\n                                    Unit #703, 7th floor, Tower B\r\n\r\n                                    Sector-30,\r\n\r\n                                    Gurugram 122001\r\n\r\n                                    Haryana State, India Tel. No.: +91 – 124 – 4020030 Kochi Manipal Technologies Limited 1 st Floor, Kalangote Towers, M.G.Road, North End, Erankulam, Kochi 682 035 Tel. No.: +91 – 484 – 4041664 Hyderabad Manipal Technologies Limited 5th Floor, Gowra Klassic, Behind Shoppers Stop, Begumpet, Hyderabad 500 016 Tel. No.: +91 – 40 – 40110294 Noida Manipal Technologies Limited Workspaces by Innova Plot No. H 54 Sector 63 NOIDA Uttar Pradesh, India 201301 Show All LoCations", "type": "url", "added_date": "2025-05-10T22:43:36.867643"}, {"source": "https://manipaltechnologies.com/blogs/", "text": "Blogs Blogs Open Your Eyes! It’s A Printed World! Are Indian Classrooms Ready For Digital Textbooks? An Unmatched Solution for Credit and Debit Card Security Identity Fraud and how it affects Anti-Money Laundering Why are cheque frauds on the rise when cheque usage is actually declining? The Approach and the Solution to a Multi-faceted Problem Tell us your requirements. Get a Demo customized as per your requirements. REQUEST A DEMO To provide you with the best possible user experience, this website uses cookies. If you continue to browse this site, you are agreeing to our use of cookies. To learn more about the cookies we use, please view our Privacy Policy . You can disable cookies at any time within your browser settings.", "type": "url", "added_date": "2025-05-10T22:43:37.919665"}, {"source": "https://manipaltechnologies.com/videos/", "text": "Videos Videos CrossFraud® – Enterprise Fraud & Risk Management Solution Suite from Manipal Technologies Limited Tell us your requirements. Get a Demo customized as per your requirements. Request a Demo To provide you with the best possible user experience, this website uses cookies. If you continue to browse this site, you are agreeing to our use of cookies. To learn more about the cookies we use, please view our Privacy Policy . You can disable cookies at any time within your browser settings.", "type": "url", "added_date": "2025-05-10T22:43:38.969836"}, {"source": "https://manipaltechnologies.com/downloads/", "text": "Downloads International Tax Stamp Association", "type": "url", "added_date": "2025-05-10T22:43:40.801926"}, {"source": "https://manipaltechnologies.com/bfsi/sahibnk/", "text": "About SahiBnk™ SahiBnk aspires to revolutionize the fintech landscape by simplifying lives through its digital and financial services. Driven by cutting-edge technology, and built on trust, SahiBnk offers an array of financial services carefully crafted to extend the ease and convenience of banking in underserved areas. From SahiBnk branches and merchant outlets to web portals and mobile applications, SahiBnk is on a journey to offer a supreme experience and high-level engagement to its customers at every touchpoint. Today, every second more than three individuals withdraw Rs 2,500 using SahiBnk platform and transformed the lives of more than 15 million families in the country. Banking at your comfort Experience the comfort of the bank branch while carrying out your financial transactions Anytime anywhere Access to a variety of banking services at your fingertips with mobile and web-based application Customized as per your needs Financial services and banking products are exclusively designed to meet customers' banking needs Win rewards Earn exciting rewards while transacting with SahiBnk Easy loan application Apply with ease for Gold loans, Home loans, Tractor loans, Personal loans, and Kisan Credit Card Digital Payment and VAS Services Financial services at nearest SahiBnk Partner point like DMT, AePs, Recharge, Bill Payment, EMI Collection, LIC Premium, etc. BANKING SIMPLIFIED! Experience Faster, Easier and Secured Banking With SahiBnk App. Bouquet of banking products One-stop solution for all your banking requirements. We offer a bouquet of banking products under one roof. Instant & Safe Funds Transfer Cash Withdrawal & Deposit (mATM & AePS) General Insurance Bank A/c balance enquiry & Mini statement Open savings account Open current account Personal Loans Two-wheeler loan Gold Loans Tractor Loans Home Loans Kisan credit card Join us in this journey to empower Bharat! SahiBnk is accelerating the fintech revolution by reaching the last mile of the unbanked and making India a financially inclusive nation. SahiBnk has embarked on a mission to make financial services available for everyone everywhere and redefine the way Bharat banks, pays, and saves! VISIT WEBSITE", "type": "url", "added_date": "2025-05-10T22:43:41.854997"}, {"source": "https://manipaltechnologies.com/bfsi/digital-banking-smart-branches-solutions/", "text": "Digital Banking: Smart Branches Solutions “With MTL’s state-of-the art Digital Banking Solutions, Bank’s customers can open an account and get personalized Debit Card of their choice and other Banking Services instantly” Manipal Technologies Limited introduces Digital Banking in India with its Smart Branches Solution, these solutions are result of our constant endeavour of understanding the needs of India’s leading banks and providing technology solutions which will help them grow.MTLs Smart Branches Solution will help the bank in leveraging digital technology by re-imagining existing processes and coming out with unique customer experience. This will help the bank in becoming the bank of choice for both existing and new-age customers. This solution will help the bank in taking a quantum leap in Digital Banking world, it will facilitate the use of state of the art technology and automated banking facilities to its customers in various segments augmentin 1000. This solution also gives a unique opportunity to the bank to reimagine banking and provide an unforgettable customer experience. Solution Highlights: Implemented India’s Largest Digital Banking Project Complete Consultation on Setting Up a Digital Smart Branch/e-Lobby Instant Account Opening Kiosk Instant Personalized EMV Debit Card Issuance Kiosk Instant Personalized EMV Debit Card Renewal/Upgradation Kiosk Instant Personalized Cheque/Pass Book Issuance/Processing Kiosk", "type": "url", "added_date": "2025-05-10T22:43:42.875360"}, {"source": "https://manipaltechnologies.com/bfsi/crossfraud-suite/", "text": "- The one-stop-shop solution for integrated enterprise financial crimes management Enterprise Fraud Risk Management Solution (EFRMS) Anti-Money Laundering Solution (AMLS) Name Screening Solution (NSS) Customer Risk Rating Framework (CRRF) CrossFraud® – an Enterprise-wide Fraud & Risk Management Solution is a product owned by Manipal Technologies Limited. CrossFraud® is self-adaptive system powered by AI which helps organizations with their regulatory compliance requirements to check money laundering and protect themselves and their customers against fraud. Read More VALUE PROPOSITION Best of Breed enterprise fraud risk management Extensible detection platform 360° view with very high detection rates and low false positive rates Scalable to match business growth Lower TCO Got Listed in RiskTech Quadrant® of Chartis Research The Manipal Technologies Limited is mentioned as a Point Solutions Vendor in the RiskTech Quadrant® by Chartis in the KYC/AML Software Solutions 2020 report. Read More The Manipal Technologies Limited is mentioned as an Enterprise Solutions Vendor in the RiskTech Quadrant® by Chartis in the Financial Crime Risk Management Systems: Enterprise Fraud 2019 report. Read More The Manipal Technologies Limited is mentioned as a Point Solutions Vendor in the RiskTech Quadrant® by Chartis in the Financial Crime Risk Management Systems: AML and Watchlist Monitoring 2019 report. Read More The Manipal Technologies Limited is mentioned as a Point Solutions Vendor in the RiskTech Quadrant® by Chartis in the Financial Crime Risk Management Systems: Know Your Customer 2019 report. Read More The Manipal Technologies Limited is mentioned as a Best of Breed vendor in the RiskTech Quadrant® by Chartis in the Financial Crime Risk Management Systems: Enterprise Fraud 2018 report. Read More The Manipal Technologies Limited is mentioned as a Point Solutions Vendor in the RiskTech Quadrant® by Chartis in the Financial Crime Risk Management Systems: Know Your Customer 2018 report. Read More To provide you with the best possible user experience, this website uses cookies. If you continue to browse this site, you are agreeing to our use of cookies. To learn more about the cookies we use, please view our Privacy Policy . You can disable cookies at any time within your browser settings.", "type": "url", "added_date": "2025-05-10T22:43:43.919890"}, {"source": "https://manipaltechnologies.com/bfsi/payment-solutions/", "text": "Payment Solutions Our unified payment solution is based on the global leaders and existing proven products that Alaric and C2P has brought on ManipalTech’s portfolio today. With these products customers today can address the challenges of siloed operations and deliver enterprise implementations. To initiate, we have Retail Payment System from (Alaric), Payment Services Hub and Testing Tools from (C2P). To originate channels like ATM, POS etc. To operate, we have Payment Simulation, Testing tools, Payment Integration and Monitoring tools and back office Management. Our customers can embark on the unified payments journey today by buying or using our current products, the most integrated solution suite available to the industry. MTL Payment System is certified with PCI  (Payment Card Industry Data Security Standard).", "type": "url", "added_date": "2025-05-10T22:43:44.901444"}, {"source": "https://manipaltechnologies.com/bfsi/card-management/", "text": "Card Management Banking / Credit / FI cards Card Management Although Indian economy is predominantly cash-based, consumers are nowadays adopting convenient ways of using debit and... Card Card Management India has predominantly been a cash-based economy. However consumers are now opening up to the convenience of utilizing... Debit Card Issuance Card Management Manipal Technologies Limited is the pioneer in the issuance of Banking cards holds the majority market share for... RTO Management Card Management MTL offers comprehensive solution for the entire life cycle of cards from issuance to distribution to Return... Help Desk Card Management MTL manages the centralized helpdesk for leading Banks for supporting their branches in Card Issuance and help them... Logistics Card Management MTL manages the entire logistics management for the cards issuance and also reverse logistics management of cards with... Pin Management Card Management MTL provides PIN printing and distribution management of PINs(both onsite and offsite) for leading Banks in the... Pin Mailers Card Management One very important product in banking is the Personal Identification Number or the PIN. It is frequently used by the... Prepaid, Travel & Gift Cards Card Management Pre-paid products have made it big in the Indian market thanks to the savings it provides with its usage. Pre-paid... EMV Cards Card Management Owing to the ability of Smart Cards to store data and maintain utmost confidentiality, its use has increased manifold... Banking / Credit / FI cards Although Indian economy is predominantly cash-based, consumers are nowadays adopting convenient ways of using debit and credit cards. Owing to the convenience, the demand for debit and credit cards has surged in urban as well as rural areas alike. RBI had issued a mandate for banks which has now resulted in utilization of plastic cards… Read More Card India has predominantly been a cash-based economy. However consumers are now opening up to the convenience of utilizing plastic cards and there is a huge surge in demand for debit and credit cards in the metros. With the RBI’s mandate of Financial Inclusion to banks, plastic cards’ utilization is set to be a norm even… Read More Debit Card Issuance Manipal Technologies Limited is the pioneer in the issuance of Banking cards holds the majority market share for Banking cards in India. MTL is the preferred partner for all the leading public and private sector Banks. MTL has capabilities to issue: a) Magstripe Base cards b) EMV Cards c) Dual Interface EMV Cards d) PayWave… Read More RTO Management MTL offers comprehensive solution for the entire life cycle of cards from issuance to distribution to Return management of Cards. Read More Help Desk MTL manages the centralized helpdesk for leading Banks for supporting their branches in Card Issuance and help them in effective tracking and managing their status with our MIS (can be made available at Bank’s intranet or MTL’s secure site). Read More Logistics MTL manages the entire logistics management for the cards issuance and also reverse logistics management of cards with partnership with all leading logistics service providers in the country including DOP with in-house DOP clearing sites. Read More Pin Management MTL provides PIN printing and distribution management of PINs(both onsite and offsite) for leading Banks in the country. Read More Pin Mailers One very important product in banking is the Personal Identification Number or the PIN. It is frequently used by the customer to ensure a secure payment process. Needless to say it has to be handled with utmost confidentiality. Manipal Technologies Limited has following capabilities: Capacity to produce high volume of PIN mailers Standardised two part… Read More Prepaid, Travel & Gift Cards Pre-paid products have made it big in the Indian market thanks to the savings it provides with its usage. Pre-paid cards are being extensively used for gifting, earning loyalty points", "type": "url", "added_date": "2025-05-10T22:43:45.993502"}, {"source": "https://manipaltechnologies.com/bfsi/financial-inclusion-solution/", "text": "Financial Inclusion Solution Majority of the Indian population is concentrated in the rural areas. Yet, Indian economy is one of the fastest growing in the world. However, the rural population is poverty ridden and this is mostly because there has been no financial awareness among the rural sections. Hence, in order to promote development, it is necessary to make the banking sector approachable to the rural class. RBI has made it mandatory for all banks to cover the rural areas of India under the financial inclusion. It requires outsourced service providers to provide adequate technology and also set up business correspondent networks or human ATMs. Manipal technologies Limited provide financial inclusion solution to banks in order to facilitate the Inclusion drive. The main features of our solution include: Potent, expansible technology in place which ensures high quality service in rural areas In-built security and disaster recovery systems so that the transactions are secure The technology is inter-operational It can be integrated to any of the existing CBS Systems with the bank and to any front-end interface Since the banks expect an efficient service by business correspondents, quick turnaround time for setting up the network and a secure transaction environment, we have effective technology in place. Our technology and their components such as Middleware/HHTs ensures the same. Solution Highlights: Rural Branch Management: All Basic Banking Facilities Complete Business Correspondent Services Social Security Payment/Government Pensions MNREGS/Students’ Scholarships/LPG Subsidy KYC Processing: e-KYC, Integrated with UIDAI (Aadhaar Card)", "type": "url", "added_date": "2025-05-10T22:43:48.149151"}, {"source": "https://manipaltechnologies.com/bfsi/corporate/", "text": "Corporate Materials Stationery Corporate Materials We use stationery in various forms everyday like writing pad, notebook, dairy, pens, paper sheets etc. In offices,... Diaries Corporate Materials Diaries and calendars are the best and most widely distributed marketing collaterals. The recipient uses it for almost... Calendars Corporate Materials Like diaries, calendars are widely distributed collateral by the organizations. Manipal Technologies Limited offer... Business Cards Corporate Materials A professional introduces himself or herself to others by handing over his or her business card. Therefore, they must... Stationery We use stationery in various forms everyday like writing pad, notebook, dairy, pens, paper sheets etc. In offices, apart from using the above stationery for internal use, they are also used for gifting purposes. This is in fact an opportunity for them to present themselves in a unique and beautiful manner- an excellent way to… Read More Diaries Diaries and calendars are the best and most widely distributed marketing collaterals. The recipient uses it for almost a year providing the best opportunity to establish business communications. Manipal Technologies Limited offer attractive, fresh and lively concepts of New Year gifting to meet the corporate demands. Customization and personalization of dairies and calendars Consistent quality… Read More Calendars Like diaries, calendars are widely distributed collateral by the organizations. Manipal Technologies Limited offer some of the best concepts for New Year gifting of these calendars. Our ideas are always unique, lively, fresh and attractive. In addition to our own ideas, we convert your ideas effectively into calendars. Our features include: Exclusive collection of inks… Read More Business Cards A professional introduces himself or herself to others by handing over his or her business card. Therefore, they must be creative, catchy and contain best quality print. At Manipal Technologies Limited, we ensure the best quality business cards that: Create an unmatched first impression Stand out for the brand you represent Fall in line with… Read More To provide you with the best possible user experience, this website uses cookies. If you continue to browse this site, you are agreeing to our use of cookies. To learn more about the cookies we use, please view our Privacy Policy . You can disable cookies at any time within your browser settings.", "type": "url", "added_date": "2025-05-10T22:43:51.646976"}, {"source": "https://manipaltechnologies.com/who-we-are/", "text": "History Stepping Stones With only one letter press machine, a handful of 15 employees and just one client - Syndicate Bank - the Manipal... Values We Believe - Innovation & Creativity We take up every opportunity to innovate and provide creative products and solutions not only to... Team The strength The highly skilled human capital led by a dedicated and motivated management team.... Careers Lead the life The Manipal Technologies Limited invites people who believe in their ability to work on fundamental principles and create... Locations Around the Globe Manipal Technologies Limited has units across the country and... Contact Us Get in Touch Corporate Office Manipal Technologies Limited... Overview With modest beginnings as the back office of Syndicate Bank in 1941, Manipal Technologies Limited has had a flourishing growth curve over these years, whilst expanding its repertoire of services across disparate business verticals. Quick to gauge an opportunity, with sound business acumen, has led the founders of Manipal Technologies Limited to innovate with their integrated solutions across industry verticals like Banking, Telecom, Education, Media Publishing, Consumer Goods and Retail, Financial services, Aviation & Transport and the Public sector. Their offerings have largely focussed on delivering secure and hassle-free financial transactions, and cutting-edge marketing and branding communications across the digital platform, to their clientele base. As these domains of secure payment transferring and targeted communications have swiftly upgraded to the “e-niche”, Manipal Technologies Limited only bettered its services and solutions to the best of industry standards. Advocating this commercial success have been a total of over 700,000 sq. feet of production area in Manipal, Chennai, Mumbai and Delhi, and a substantial number of marketing offices across the country’s major cities, ensuring that a close point of contact is always available to their customers. With an ISO 9001:2000 QMS certification, the manufacturing units are equipped with world-class technologies and high-end equipment for that on-dot perfection in their diverse technological applications. Manipal Technologies Limited’ farsighted vision and ambitious mission are to only ensure a global footprint for the company and its members in the near future. Mr. Abhay Anant Gupte Managing Director and Chief Executive Officer As Managing Director and Chief Executive Officer, at Manipal Technologies Limited, Abhay Anant Gupte helps our clients overcome their challenges through curated print, technology and digital solutions. With his global perspective and 35+ years of experience, he is a recognized expert in business processes related to banking and technology, with several national speaking credits and mentorships to his name.\r\n\r\nHis career is focused on Management and Optimization with expertise in administering technology and team development. As a senior executive with an excellent track record in Strategy & Business Development, Client Engagements, Business & Service Delivery Operations and People Management; Mr Gupte holds a superior hand in driving MTL’s growth to its current heights. \r\n\r\nMr Gupte is a postgraduate from IIT Delhi and comes with around 4 decades of proficiency in Banking, Financial Services, and Information Technology. Before moving onboard MTL, Mr Gupte was the MD and Partner at Logica – a six billion US$ organization with 42000 employees spread across 37 countries. Mr Gupte was MD of EDS India for about a decade. He has contributed 12 years in the Banking and Financial Services industry; first with American Express Bank, where he progressed to become Director of Information Technology and then with GE Capital Services as CIO & VP – IT. To provide you with the best possible user experience, this website uses cookies. If you continue to browse this site, you are agreeing to our use of cookies. To learn more about the cookies we use, please view our Pr", "type": "url", "added_date": "2025-05-10T22:43:55.597521"}, {"source": "https://manipaltechnologies.com/who-we-are/team", "text": "The highly skilled human capital led by a dedicated and motivated management team. Abhay Gupte Managing Director & Chief Executive Officer Mr. Abhay has more than 39 years of work experience in the information technology, banking, and\r\n                        financial services industry. He has been driving the growth and expansion of Manipal\r\n                        Technologies Limited (MTL) since he joined the company in 2013. Under Abhay’s leadership, MTL\r\n                        has successfully entered and excelled in diverse business domains, achieving significant\r\n                        milestones, and securing a prominent market position. His ability to navigate through dynamic\r\n                        industry landscapes has propelled MTL to the forefront of innovation and business excellence. Abhay extends his expertise beyond MTL as an Independent Director for a listed company. His role\r\n                        as a board member reflects his commitment to corporate governance and contributing to the\r\n                        success of organizations beyond his executive responsibilities. Abhay serves as a trusted mentor\r\n                        to the executive leadership team of large global brands. Abhay is a post-graduate from IIT\r\n                        Delhi. Additionally, he is an alumnus of Singularity University, further demonstrating his\r\n                        commitment to staying at the forefront of technological advancements and innovation. Girish Kini Chief Executive Officer – MCT Cards and Technology Private Limited Mr. Girish Kini is B.E. in Mechanical Engineering from Manipal Institute of Technology. He\r\n                            joined the organization 1997 on the shop floor, and over the years worked his way up to the\r\n                            Head of SBUs of “Secure Transactions” – Security Printing, Business Forms, Transactional\r\n                            Production, MCT Cards & Technology Pvt. Ltd. Shashi Ranjan Chief Executive Officer – Commercial Print Mr. Shashi Ranjan is B.E. in Printing Technology from Manipal Institute of Technology. He\r\n                            joined the organization in 1998 and worked his way from the bottom of the ladder to become\r\n                            the Head of SBUs of Commercial Printing and Print Management Solutions (PMS). Nagendra Rao T R Chief Growth Officer Mr. Nagendra Rao is a B.E degree holder in Mechanical Engineering from Karnataka University,\r\n                            Dharwad and joined Manipal Technologies Limited in the year in 1989. He has a rich\r\n                            experience of 30 years\r\n                            in different fields of production including Security, Commercial, Paper cards, etc.In his\r\n                            current position as VP-Marketing, he is in charge of the sales and marketing activities of\r\n                            Manipal Technologies Limited and its subsidiary companies including MCT, Manipal Packaging\r\n                            and\r\n                            Universal print systems. Guruprasad Kamath H Chief Executive Officer – Digital Solutions An alumnus of Manipal Institute of Technology, Guruprasad Kamath has over 18 years of work\r\n                            experience with a multitude of organizations operating in domains of IT, ITES and financial\r\n                            services. He heads the Digital Solutions business unit in MTL which offers a comprehensive\r\n                            solutions suite in pre-media and digital content space. Rajesh Shet Group Business Development Officer Mr. Rajesh Shet has over 30 years of experience in the ITeS, fintech, and financial services industries. He has been associated with the company for 20 years and has played an instrumental role in driving growth and expansion opportunities in the banking domain. His diverse experience spans incubating, building and scaling new lines of business in the financial services sector, l", "type": "url", "added_date": "2025-05-10T22:43:57.183532"}]